interface SearchResultsData{
  name: string,
  adjective: string,
  date: string
}
export interface SearchResults {
  count: number,
  data: SearchResultsData[]
}

export const SORRY: string = 'عـذرًا !';

export const AlertMessages = {
  SUCCCESS: (number: number) => `عدد نتائج البحث الحالي:<span class="bold">${number}</span>`,
  ERROR: (title?: string) => {
    return `${title ? '<span class="bold">'+title+'</span>': ''}
     لا توجد أي نتائج للبحث الحالي`
  }
};
export enum AlertEnum{
  SUCCCESS  = "SUCCCESS",
  ERROR     = "ERROR",
}

// mock data
export const searchResponse: SearchResults = {
  count: 50,
  data: [
    {
      name: "، والله على ما نقول شهيد ، وبما نحن عليه بصير «. قال أبو عبيدة : فلما تأهبت للنهوض ،",
      adjective: "لَقيط بن زُرارة الدّارميّ",
      date: "ع3‏ق.هـ‏=‏619‏‏م‏",
    },
    {
      name: "، والله على ما نقول شهيد ، وبما نحن عليه بصير «. قال أبو عبيدة : فلما تأهبت للنهوض ،",
      adjective: "لَقيط بن زُرارة الدّارميّ",
      date: "ع3‏ق.هـ‏=‏619‏‏م‏",
    },
    {
      name: "، والله على ما نقول شهيد ، وبما نحن عليه بصير «. قال أبو عبيدة : فلما تأهبت للنهوض ،",
      adjective: "لَقيط بن زُرارة الدّارميّ",
      date: "ع3‏ق.هـ‏=‏619‏‏م‏",
    },
    {
      name: "، والله على ما نقول شهيد ، وبما نحن عليه بصير «. قال أبو عبيدة : فلما تأهبت للنهوض ،",
      adjective: "لَقيط بن زُرارة الدّارميّ",
      date: "ع3‏ق.هـ‏=‏619‏‏م‏",
    },
    {
      name: "، والله على ما نقول شهيد ، وبما نحن عليه بصير «. قال أبو عبيدة : فلما تأهبت للنهوض ،",
      adjective: "لَقيط بن زُرارة الدّارميّ",
      date: "ع3‏ق.هـ‏=‏619‏‏م‏",
    },
    {
      name: "، والله على ما نقول شهيد ، وبما نحن عليه بصير «. قال أبو عبيدة : فلما تأهبت للنهوض ،",
      adjective: "لَقيط بن زُرارة الدّارميّ",
      date: "ع3‏ق.هـ‏=‏619‏‏م‏",
    },
    {
      name: "، والله على ما نقول شهيد ، وبما نحن عليه بصير «. قال أبو عبيدة : فلما تأهبت للنهوض ،",
      adjective: "لَقيط بن زُرارة الدّارميّ",
      date: "ع3‏ق.هـ‏=‏619‏‏م‏",
    },
    {
      name: "، والله على ما نقول شهيد ، وبما نحن عليه بصير «. قال أبو عبيدة : فلما تأهبت للنهوض ،",
      adjective: "لَقيط بن زُرارة الدّارميّ",
      date: "ع3‏ق.هـ‏=‏619‏‏م‏",
    },
    {
      name: "، والله على ما نقول شهيد ، وبما نحن عليه بصير «. قال أبو عبيدة : فلما تأهبت للنهوض ،",
      adjective: "لَقيط بن زُرارة الدّارميّ",
      date: "ع3‏ق.هـ‏=‏619‏‏م‏",
    },
    {
      name: "، والله على ما نقول شهيد ، وبما نحن عليه بصير «. قال أبو عبيدة : فلما تأهبت للنهوض ،",
      adjective: "لَقيط بن زُرارة الدّارميّ",
      date: "ع3‏ق.هـ‏=‏619‏‏م‏",
    },
    {
      name: "، والله على ما نقول شهيد ، وبما نحن عليه بصير «. قال أبو عبيدة : فلما تأهبت للنهوض ،",
      adjective: "لَقيط بن زُرارة الدّارميّ",
      date: "ع3‏ق.هـ‏=‏619‏‏م‏",
    },
    {
      name: "، والله على ما نقول شهيد ، وبما نحن عليه بصير «. قال أبو عبيدة : فلما تأهبت للنهوض ،",
      adjective: "لَقيط بن زُرارة الدّارميّ",
      date: "ع3‏ق.هـ‏=‏619‏‏م‏",
    },
    {
      name: "، والله على ما نقول شهيد ، وبما نحن عليه بصير «. قال أبو عبيدة : فلما تأهبت للنهوض ،",
      adjective: "لَقيط بن زُرارة الدّارميّ",
      date: "ع3‏ق.هـ‏=‏619‏‏م‏",
    },

  ]
}
